package com.korotkov.config;

public class Constants {
    public static final String PATH_TO_ENTITY_CHARACTERISTIC = "resources/entity_characteristic.json";
    public static final String PATH_TO_IMAGES_OF_ENTITIES = "resources/images_of_entities.json";
    public static final String PATH_TO_POSSIBILITY_OF_EATING = "resources/possibility_of_eating.json";
    public static final String PATH_TO_ISLAND_SETTINGS = "resources/settings.properties";

    public static final int ALL_ANIMALS_DIED = 1;
    public static final int ALL_PREDATORS_DIED = 2;
    public static final int ALL_HERBIVORES_DIED = 3;

    public static final String DOLLARS = "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$";
    public static final String GREETINGS = "!!! Добро пожаловать в игру ☠ \033[1;35mGAME\033[0m_\033[1;32mOF\033[0m_\033[1;33mISLAND\033[0m ☠ !!!";

    public static final String CHANGE_SETTINGS = """
            ***********************************************************************
                      \033[1;34mМЕНЮ\033[0m
            1 - ⚙  Настройки  🔧
            2 - 🚀 Запуск игры 🚀
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            \033[31m!!!ВНИМАНИЕ!!! ВО ВРЕМЯ ИГРЫ => ПАУЗА/настройки: "p"\033[0m
            ***********************************************************************
            """;
    public static final String PAUSE_MENU = """
            ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
               \033[1;34mМЕНЮ ПАУЗЫ\033[0m
            c - Continue game
            o - Options
            r - Restart game
            e - Exit game
            ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
            """;

    public static final String CHOOSE_YOUR_DESTINY = """
            &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
                     \033[1;34mГЛАВНОЕ МЕНЮ НАСТРОЕК\033[0m
            Пожалуйста, выберите нужную категорию:
            1 - 🏝️ Изменение настроек острова 🌋
            2 - 🐏 Изменение настроек животных и растений 🍀
            3 - ⛔ Изменение условия остановки игры ⛔
            4 - 🏃🚪💨 Выход из настроек 🏃‍♂🚪💨
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            \033[31m!!!ВНИМАНИЕ!!! ВО ВРЕМЯ ИГРЫ => ПАУЗА/настройки: "p"\033[0m
            &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
            """;

    public static final String CHOOSE_STOP_CONDITIONS = """
            #######################################################################
             \033[1;34mВыберите условие остановки игры:\033[0m
             1 - Если все животные погибли
             2 - Если погибли все хищники
             3 - Если погибли все травоядные
             4 - Выход в главное меню настроек
             \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
             #######################################################################
            """;

    public static final String SET_WIDTH_OF_ISLAND = """
            #######################################################################
             \033[1;34mПожалуйста, введите ширину острова\033[0m
             (цифры от 1 до 150: некорректные данные не будут применены!)
            #######################################################################
            """;

    public static final String SET_HEIGHT_OF_ISLAND = """
            #######################################################################
             \033[1;34mПожалуйста, введите длину острова:\033[0m
             (цифры от 1 до 150: некорректные данные не будут применены!)
            #######################################################################
            """;

    public static final String SET_DAYS_OF_ISLAND = """
            #######################################################################
             \033[1;34mПожалуйста, введите количество дней жизни на острове:\033[0m
             (цифры от 1 до 365: некорректные данные не будут применены!)
            #######################################################################
            """;

    public static final String GO_GO_GO = """
            >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
            <=== !!! \033[1;32mПОЕХАЛИ\033[0m !!! ===>
            >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
            """;

    public static final String CHOOSE_CATEGORY_OF_ENTITY_SETTINGS = """
            #######################################################################
            \033[1;34mНАСТРОЙКИ ЖИВОТНЫХ И РАСТЕНИЙ:\033[0m
            1 - 🐺 Хищники 🦊
            2 - 🐏 Травоядные 🦌
            3 - 🍀 Растения 🌿
            4 - 🔙 Выход в главное меню настроек 🔙
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            #######################################################################
            """;

    public static final String CHANGE_PREDATOR_SETTINGS = """
            #######################################################################
                      \033[1;34mНАСТРОЙКИ ХИЩНИКОВ\033[0m
            1 - Изменение настроек всех хищников
            2 - Выбрать хищника
            3 - 🔙 Выход в общее меню настроек животных и растений 🔙
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            #######################################################################
            """;

    public static final String CHANGE_HERBIVORES_SETTINGS = """
            #######################################################################
                      \033[1;34mНАСТРОЙКИ ТРАВОЯДНЫХ\033[0m
            1 - Изменение настроек всех травоядных
            2 - Выбрать травоядное
            3 - 🔙 Выход в общее меню настроек животных и растений 🔙
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            #######################################################################
            """;


    public static final String ALL_ANIMAL_WEIGHT = """
            #######################################################################
            \033[1;34mНа сколько килограмм увеличить (- уменьшить) вес всех %s ?\033[0m
            Введите double-число от -50.0 до 100.0 :
            #######################################################################
            """;
    public static final String ALL_ANIMAL_COUNT = """
            #######################################################################
            \033[1;34mНа сколько единиц увеличить (- уменьшить) максимальное количество
            на одной клетке всех %s ?\033[0m
            Введите целое число от -50 до %d :
            #######################################################################
            """;
    public static final String ALL_ANIMAL_SPEED = """
            #######################################################################
            \033[1;34mНа сколько единиц увеличить (- уменьшить) скорость всех %s ?\033[0m
            Введите целое число от -5 до 5
            #######################################################################
            """;
    public static final String ALL_ANIMAL_KG_TO_GET_FULL = """
            #######################################################################
            \033[1;34mНа сколько единиц увеличить (- уменьшить) количество килограмм пищи
            до полного насыщения всех %s ?\033[0m
            Введите double-число число от -50.0 до 100.0 :
            #######################################################################
            """;
    public static final String ALL_ANIMAL_COUNT_BORN_BABY = """
            #######################################################################
            \033[1;34mНа сколько единиц увеличить (- уменьшить) количество приплода
            у всех %s ?\033[0m (Настройки по умолчанию: 20 детёнышей)
            Введите целое число от -20 до 100:
            #######################################################################
            """;

    public static final String CHANGE_PLANTS_SETTINGS = """
            #######################################################################
            \033[1;34mНАСТРОЙКИ РАСТЕНИЙ:\033[0m
            1 - выбрать растение
            2 - 🔙 Выход в общее меню настроек животных и растений 🔙
            \033[33mДля выхода из игры нажмите любую другую цифру!\033[0m
            #######################################################################
            """;

    public static final String CHOOSE_CURRENT_ENTITY = """
            #######################################################################
            \033[1;34mПожалуйста выберите конкретное %s:\033[0m
            #######################################################################
            """;

    public static final String CHOOSE_FROM_LIST = """
            #######################################################################
            \033[1;34mПожалуйста введите цифру из предложенного списка!\033[0m
            #######################################################################
            """;

    public static final String SET_WEIGHT = """
            #######################################################################
            \033[1;34mПожалуйста введите вес для %s\033[0m (double-число):
            #######################################################################
            """;
    public static final String SET_COUNT = """
            #######################################################################
            \033[1;34mПожалуйста введите максимальное количество на одной клетке для %s\033[0m
            (целое число от 1 до %d):
            #######################################################################
            """;
    public static final String SET_SPEED = """
            #######################################################################
            \033[1;34mПожалуйста введите скорость перемещения для %s\033[0m
            (целое число):
            #######################################################################
            """;
    public static final String SET_KG_TO_FULL = """
            #######################################################################
            \033[1;34mПожалуйста введите количество килограмм пищи
            до полного насыщения для %s\033[0m (double-число):
            #######################################################################
            """;
    public static final String SET_COUNT_MAX_BORN_BABY = """
            #######################################################################
            \033[1;34mПожалуйста введите количество приплода для %s\033[0m
            (целое число):
            #######################################################################
            """;

    public static final String EXIT_FROM_SETTINGS = """
            ///////////////////////////////////////////////////////////////////////
            >>> \033[1;33mВыход из настроек!\033[0m >>>
            ///////////////////////////////////////////////////////////////////////
            """;

    public static final String INTEGER_PARSE_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка, Вы неправильно ввели число! Пожалуйста введите целое число!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String DOUBLE_PARSE_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка, Вы неправильно ввели число!
            Пожалуйста введите double - число c точкой!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String INPUT_OUTPUT_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Внимание, зафиксирована ошибка ввода-вывода при считывании ввода клавиатуры!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String OBJECT_READ_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка ввода-вывода:
            1. проверьте правильно ли вы указали путь к файлу %s"
            2. Проверьте структуру указанного файла %s
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String GET_CONSTRUCTOR_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка! Нет указанного конструктора в классе: %s
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;
    public static final String CREATE_CURRENT_ENTITY_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка! Не удалось создать объект класса: %s
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String REPRODUCE_ERROR = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Ошибка! У животных: %s и %s
            не получилось создать новый экземпляр животного!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String CHOOSE_CORE = """
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            Пожалуйста выберите одну из предложенных букв: c/o/r/e
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            """;

    public static final String STATISTIC_OF_DAY = """
            ***********************************************************************
             \033[1;33mСТАТИСТИКА ЗА ПРОШЕДШИЙ ДЕНЬ № %d:\033[0m
            """;
    public static final String LIVE_ANIMALS = "\033[36mНа острове живут %d животных:\033[0m\n";
    public static final String BORN_ANIMALS = "\n\033[36mРодились %d животных:\033[0m\n";
    public static final String DEAD_ANIMALS = "\n\033[36mУмерло %d животных:\033[0m\n";
    public static final String LIVE_PLANTS = "\n\033[32mРастут %d растений:\033[0m\n";
    public static final String EAT_PLANTS = "\n\033[32mСъедено %d растений:\033[0m\n";
    public static final String DIFFERENCE = "\n\033[33mРазница между первым и текущим днём:\033[0m";
    public static final String MORE_ANIMALS = "\033[36mОбщее количество животных стало больше на %d особей:\033[0m\n";
    public static final String LESS_ANIMALS = "\033[36mОбщее количество животных стало меньше на %d особей:\033[0m\n";
    public static final String NO_CHANGES_ANIMALS = "\033[36mОбщее количество животных не изменилось:\033[0m";
    public static final String MORE_PLANTS = "\033[32mОбщее количество растений стало больше на %d штук:\033[0m\n";
    public static final String LESS_PLANTS = "\033[32mОбщее количество растений стало меньше на %d штук:\033[0m\n";
    public static final String NO_CHANGES_PLANTS = "\033[32mОбщее количество растений не изменилось:\033[0m\n";
    public static final String END = "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&";

    public static final String GAME_OVER = """
            $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
            \033[31m<<< !!! 😈 GAME OVER 😈 !!! >>>\033[0m
            $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
            """;
}
